AUTO_config_TK_pesok/src/Documents/КонсолидированныеПродажи/КонсолидированныеПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонсолидированныеПродажи</name>
  <registerRecords>AccumulationRegister.КонсолидированныеПродажи</registerRecords>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>Таблица товаров и услуг</comment>
    <attributes>
      <name>СтатусПартии</name>
      <comment>Статус партии, определяющий, чей товар мы продали (собственный компанией или принятый на комиссию)</comment>
      <type>
        <types>EnumRef.СтатусыПартий</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеКомпании</name>
      <comment>Подразделение компании в котором был выписан документ</comment>
      <type>
        <types>CatalogRef.ПодразделенияКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>СкладКомпании</name>
      <type>
        <types>CatalogRef.СкладыКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар, услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>Характеристика номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>Ставка НДС по номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество единиц измерения номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <comment>Себестоимость регл. учета с учетом налогов</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>Сумма НДС по номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <comment>Итоговая сумма по строке документа со всеми налогами</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  </aggregates>
  <resources>
    <name>Количество</name>
    <comment>Количество проданного товара</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <comment>Сумма с учетом налогов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <comment>Сумма НДС в валюте регл. учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСкидки</name>
    <comment>Сумма скидки в валюте регл. учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма упр. учета с учетом налогов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <comment>Себестоимость регл. учета с учетом налогов но без доп. расходов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДСВходящий</name>
    <comment>Сумма входящего НДС в валюте регл. учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СебестоимостьУпр</name>
    <comment>Себестоимость упр. учета с учетом налогов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаАкциза</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был зафиксирован факт продажи товара</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкладКомпании</name>
    <comment>Склад компании</comment>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Проданный товар или оказанная услуга</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <comment>Характеристика номенклатуры</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозОперация</name>
    <comment>Хозяйственная операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлассификаторПродажи</name>
    <type>
      <types>CatalogRef.КлассификаторПродаж</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <comment>Поставщик у которого товар был куплен</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Покупатель</name>
    <comment>Покупатель который купил товар или которому была оказана услуга</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорВзаиморасчетов</name>
    <comment>Договор взаиморасчетов с покупателем</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <comment>Ставка НДС</comment>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусПартии</name>
    <comment>Статус партии, определяющий, чей товар мы продали (собственный компанией или принятый на комиссию)</comment>
    <type>
      <types>EnumRef.СтатусыПартий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <comment>Партия</comment>
    <type>
      <types>DefinedType.ТипыПартий</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AUTO_config_TK_pesok/src/Enums/СтатусыПартий/СтатусыПартий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПартий</name>
  <comment>Статусы партий</comment>
  <enumValues>
    <name>ТоварКупленный</name>
    <comment>Товар (купленный)</comment>
  </enumValues>
  <enumValues>
    <name>ТоварПринятыйКомиссия</name>
    <comment>Товар (принятый на комиссию)</comment>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Documents/КонсолидированныеПродажи/Forms/ФормаЗаполнения/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДокПродажи = Параметры.Ссылка;
	Период.Вариант = ВариантСтандартногоПериода.Последние7Дней;
КонецПроцедуры

&НаСервере
Функция ПолучитьПродажи(Номенклатура,Всего)
			СписокОпераций = Новый СписокЗначений;
		//СписокОпераций.Добавить(Справочники.ХозОперации.ВозвратТоваровОтПокупателя);
		//СписокОпераций.Добавить(Справочники.ХозОперации.РеализацияТоваров);
		//СписокОпераций.Добавить(Справочники.ХозОперации.РеализацияТоваровРозница);
		СписокОпераций.Добавить(Справочники.ХозОперации.ЗакрытиеСмены);
		СписокОпераций.Добавить(Справочники.ХозОперации.ЗакрытиеСменыВозврат);
		
		Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный) КАК СтатусПартии,
	|	ПродажиОбороты.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ПродажиОбороты.СкладКомпании КАК СкладКомпании,
	|	ПродажиОбороты.КоличествоОборот КАК КоличествоОборот,
	|	ПродажиОбороты.СуммаОборот / ПродажиОбороты.КоличествоОборот КАК ЦенаПродажи,
	|	ПродажиОбороты.СебестоимостьУпрОборот / ПродажиОбороты.КоличествоОборот КАК ЦенаСеб,
	|	ПродажиОбороты.КоличествоОборот / &Всего КАК Поле1
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			ХозОперация В (&СписокХоз)
	|				И Номенклатура = &Номенклатура
	|				И СкладКомпании В ИЕРАРХИИ (&СкладКомпании)) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.КоличествоОборот > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеКомпании,
	|	СкладКомпании
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("СкладКомпании", Склады);
	Запрос.УстановитьПараметр("СписокХоз", СписокОпераций);
	Запрос.УстановитьПараметр("Всего", Всего);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТЧТовар(ДокПродажи)
	ОбъектДокПродажи = ДокПродажи.ПолучитьОбъект();
	ОбъектДокПродажи.Товары.Очистить();
	
	Для Каждого стрТовар  из Товары Цикл 
		тзОборот = ПолучитьПродажи(стрТовар.Номенклатура,стрТовар.Количество);
		Всего = тзОборот.Итог("КоличествоОборот");
		
		Для Каждого стрОборот из ТзОборот Цикл
			
			Коф = стрОборот.КоличествоОборот/ Всего;
			Количество = Окр( Коф* стрТовар.Количество);
			Если Количество = 0 Тогда Продолжить; КонецЕсли;
			стТов = ОбъектДокПродажи.Товары.Добавить();
			стТов.СтатусПартии			= стрОборот.СтатусПартии;
			стТов.ПодразделениеКомпании	= стрОборот.ПодразделениеКомпании;
			стТов.СкладКомпании			= стрОборот.СкладКомпании;
			стТов.Номенклатура			= стрТовар.Номенклатура;
			стТов.ХарактеристикаНоменклатуры = стрТовар.МРЦ;
			стТов.СтавкаНДС				= стТов.Номенклатура.СтавкаНДС;
			стТов.Количество			= Количество;
			стТов.Себестоимость			= стТов.Количество*стрОборот.ЦенаСеб;
			стТов.СуммаВсего			= стТов.Количество*стрОборот.ЦенаПродажи;
			стТов.СуммаНДС				= стТов.СуммаВсего*стТов.СтавкаНДС.Ставка/(100+стТов.СтавкаНДС.Ставка);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ОбъектДокПродажи.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТовар()
	Товары.Очистить();
	
	Для НомерСтроки = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл
		КодТовара = СокрЛП(ТабличныйДокумент.Область(НомерСтроки,3,НомерСтроки,3).Текст);
		
		Если ПустаяСтрока(КодТовара) Тогда 
			Продолжить; 
		КонецЕсли; 						
		
		КодТовара = СтрЗаменить(КодТовара, " ", "");
		
		ТекстОшибки = "";
		
		ТоварСсылка = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", КодТовара); 
		Если ТоварСсылка.Пустая() Тогда 
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Строка %1. Товар с артикулом %2 - не найден!'; uk = 'Строка %1. Товар з артикулом %2 - не знайдений!'"),
			НомерСтроки,
			КодТовара);
			
		ИначеЕсли ТоварСсылка.ПометкаУдаления Тогда 
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Строка %1. Товар  [%2] %3 - помечен на удаление!'; uk = 'Строка %1. Товар  [%2] %3 - відмічений на видалення!'"),
			НомерСтроки,
			КодТовара,
			ТоварСсылка);
			
		КонецЕсли;
		
		Если Не ПустаяСтрока(ТекстОшибки) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		знМРЦ = СокрЛП(ТабличныйДокумент.Область(НомерСтроки,2,НомерСтроки,2).Текст);
		знМРЦ = Число(знМРЦ);
		Если ЗначениеЗаполнено(знМРЦ) Тогда
			МРЦ = Справочники.ХарактеристикиНоменклатуры.НайтиПоРеквизиту("ЗначениеМРЦ", знМРЦ,,ТоварСсылка);
		Иначе
			МРЦ = "";
		КонецЕсли;
		
		Количество = ТабличныйДокумент.Область(НомерСтроки,4,НомерСтроки,4).Текст;		
		
		стрТовары = Товары.Добавить();
		стрТовары.Номенклатура = ТоварСсылка;
		стрТовары.МРЦ = МРЦ;
		стрТовары.Количество = Количество;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ВсеОк = Истина;
	Если Не ТабличныйДокумент.ВысотаТаблицы > 1 Тогда 
		ВсеОк = Ложь;
		ТекстСообщения = НСтр("ru = 'Нет данных для загрузки'; uk = 'Немає даних для завантаження'");
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;
	
	Если ВсеОк Тогда 
		ОчиститьСообщения();
		ЗаполнитьТовар();
		Если ЗначениеЗаполнено(Товары) Тогда
			ЗаполнитьТЧТовар(ДокПродажи);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
